
INSERT INTO sun (date, city_id,sunset, sunrise)
VALUES ('2023-10-18',411,'16:30:00', '08:30:00'),
       ('2022-01-19',411, '16:31:00', '08:31:00'),
       ('2023-10-20',411, '16:32:00', '08:32:00');

INSERT INTO menu (id, city_id, temperature, precipitation, uv_index, wind_speed, wind_direction, visibility)
VALUES ('2023-10-18 18:24:00', 411, -5.0, 0.5, 2, 10.0, 'NE', 10.0),
('2023-10-19 12:00:05', 411, -16.0, 0.5, 2, 10.0, 'NE', 10.0),
('2023-10-20 12:00:01', 411, -10.0, 0.0, 0, 5.0, 'SW', 5.0),
('2023-10-21 12:00:02', 411, -20.0, 0.1, 1, 20.0, 'NW', 2.0),
('2023-10-22 12:00:03', 411, -30.0, 0.2, 3, 15.0, 'SE', 1.0),
('2024-10-23 12:00:04', 411, -40.0, 0.3, 4, 25.0, 'E', 0.5);

INSERT INTO family (name)
VALUES ('Злаки'),
    ('Травы'),
    ('Деревья'),
    ('Грибы');



INSERT INTO flower (name, family)
VALUES ('Берёза','Деревья'),
    ('Ольха','Деревья'),
    ('Кладоспориум','Грибы');

INSERT INTO map (month, name_flower, x, y)
VALUES ('Июнь', 'Берёза', 12, 20, 1),
    ('Июль', 'Ольха', 30, 40, 3),
    ('Август', 'Береза', 50, 60, 1),
    ('Сентябрь', 'Кладоспориум', 7, 8, 2);
